Repository: pikougi-nabot/epochrefs-old
Catalog: commit/84000/data-translation-memory/toh44-45_84000-the-stem-array.tmx/chapters-26-37.tmx
Source language: bo
Languages: en

source: དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་གྱིས་རྒྱུན་ཏུ་ཞུགས་པའི་ལམ་ཡོངས་སུ་གནས་པས།
en: approaching a kalyāṇamitra while following the path of entering the stream of all the ways of the realm of phenomena;

source: དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བ་དང་། ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་ཐམས་ཅད་ལ་དམིགས་པ་ལས་མ་གཡོས་པར།
en: and approaching a kalyāṇamitra without deviating from being focused on all the ways of the realm of phenomena and pervading the entire realm of phenomena.

source: ཆོས་ཀྱི་དབྱིངས་ཀུན་ཏུ་རྒྱས་པར་འགེངས་པས་དགེ་བའི་བཤེས་གཉེན་གྱི་དྲུང་དུ་འགྲོ་བས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ་གང་ན་བ་དེར་ཕྱིན་པ་དང་། དེས་མཚན་མོའི་ལྷ་མོ་རབ་ཏུ་དགའ་བའི་མིག་འགྲོ་བར་རྣམ་པར་སྣང་བ། བཅོམ་ལྡན་འདས་ཀྱི་འཁོར་གྱི་དཀྱིལ་འཁོར་ན་སེང་གེའི་ཁྲི་མེ་ཏོག་གི་སྙིང་པོ་ཅན་ལ་འདུག་ཅིང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་ཀུན་ཏུ་བཟང་པོའི་དགའ་བ་ཡངས་ཤིང་དྲི་མ་མེད་པའི་ཤུགས་ཀྱི་རྒྱལ་མཚན་ལ། མཉམ་པར་བཞག་པ་མཐོང་ངོ་།
en: He saw the night goddess Pramudita­nayana­jagad­virocanā seated on a flower in the center of a lion throne within the circle of the assembly of the Bhagavat, resting in the bodhisattva samādhi called the banner of the power of vast, stainless, completely good joy

source: །དེའི་བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས་སྦྱིན་པ་ལ་སྩོགས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་སྤྱོད་པ་མངོན་པར་སྟོན་པའི་སྤྲིན་སེམས་ཅན་ཐམས་ཅད། མངོན་པར་དགའ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་དུ་འོང་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བལྟ་ན་ཉམས་སུ་བདེ་བ། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་བལྟ་ན་སྡུག་པ་རྣམ་པ་སྣ་ཚོགས་འབྱུང་བ་ཡང་མཐོང་སྟེ།
en: He saw emanating from all her pores clouds of manifestations of the practice of the perfections, such as generosity, which delighted all beings, which brought pleasure to all beings, and which were various kinds of beauty for all beings.

source: འདི་ལྟར་སེམས་ཅན་ཐམས་ཅད་ལ་ཕན་གདགས་ཤིང་རྩོད་པ་མེད་པར་བྱ་བ་དང་། དངོས་པོ་ཐམས་ཅད་ལ་ཕངས་པར་རྩི་བ་མེད་པར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་སྦྱོར་བ་མཚུངས་པས་ཡོངས་སུ་གཏང་བར་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་མཉམ་པའི་སེམས་སུ་བྱ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་བརྙས་པ་མེད་པར་ཡོངས་སུ་གཏང་བ་དང་། ནང་དང་ཕྱིའི་དངོས་པོ་ཐམས་ཅད་ཡོངས་སུ་གཏང་བ་དང་དགའ་བ་ཆེན་པོ་ཡོངས་སུ་གཏང་བར་བསྟན་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་དུ་སེམས་ཅན་གྱི་བསམ་པ་ཇི་བཞིན་གྱི་སྦྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་བསྟན་པར་བྱ་བའི་ཕྱིར།
en: They were like this: he saw clouds of manifestations of the practice of generosity in accord with the aspirations, perceptions, and languages of all beings, in order to benefit beings without causing discord, in order for there to be no concern for all material things, in order to give equally to all beings, in order for there to be impartiality toward all beings, in order to give respectfully to all beings, in order to give all inner and outer things, in order to manifest the generosity that is difficult, and in order to manifest in all worlds the practice of generosity according to the wishes of beings.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྣམ་པར་དམིགས་པ་དང་མཐུན་པའི་སྒྲས་སྦྱིན་པའི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པའི་སྤྲིན་དང་། དུས་གསུམ་དུ་བྱུང་བའི་བྱང་ཆུབ་སེམས་དཔའ་རྣམས་གཏང་བར་དཀའ་བ་ཡོངས་སུ་གཏོང་བའི་སྤྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པའི་སྤྲིན་འཐོན་ནས། ཕྱོགས་བཅུའི་འཇིག་རྟེན་གྱི་ཁམས་འབྱམ་ཀླས་པར་གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱིས་རྣམ་པར་དམྱིགས་པར་གྱུར་པ་མཐོང་ངོ་།
en: He saw clouds of manifestations of the countless difficult acts of generosity by the bodhisattvas that appear in the three times, which being emanated were perceived by all beings within the vast extent of the worlds in the ten directions.

source: །འདི་ལྟ་སྟེ།
en: It was like this:

source: བྱང་ཆུབ་སེམས་དཔའི་ཁྱུ་མཆོག་གི །མཐུ་ཕྱུང་བ་དང་། རྣམ་པར་འཕྲུལ་པ་བསམ་གྱིས་མི་ཁྱབ་པ་ཐོབ་པས། བ་སྤུའི་བུ་ག་ཐམས་ཅད་ནས། སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པའི་སྐྱེ་བ་སྣ་ཚོགས་སུ་སྤྲུལ་པའི་ལུས་ཀྱི་སྤྲིན་མངོན་པར་འཐོན་ཏེ། འཇིག་རྟེན་གྱི་ཁམས་ཐམས་ཅད་དུ།
en: because of her attainment of the inconceivable miraculous powers of the might of bodhisattvas, he saw, issuing forth from all her pores, clouds of emanated bodies of various beings, equal in number to that of all beings, which spread throughout all beings within all world realms, demonstrating directly to them the unwavering commitment to vows of discipline;

source: གཏོགས་པའི་སེམས་ཅན་ཐམས་ཅད་ལ་རྒྱས་པར་ཁྱབ་པར་བྱས་ནས།
en: demonstrating throughout the realms of beings the field of the various vows of discipline of asceticism;

source: མངོན་སུམ་དུ་བརྟུལ་ཞུགས་ཐམས་ཅད་ཀྱི་ཡིད་དམ་ལས་མི་གཡོ་བར་ཡོངས་སུ་བསྟན་པ་དང་། སེམས་ཅན་གྱི་ཁམས་དང་མཉམ་པའི་དཀའ་ཐུབ་དང་། བརྟུལ་ཞུགས་ཀྱི་དཀྱིལ་འཁོར་སྣ་ཚོགས་རབ་ཏུ་སྟོན་པ་དང་། འཇིག་རྟེན་ཐམས་ཅད་དུ་གནས་པ་མེད་པ་དང་། ཡུལ་ཐམས་ཅད་ལ་ལྟོས་པ་མེད་པ་དང་། འཁོར་བ་ཐམས་ཅད་དུ་གནས་པ་ལས་ཕྱིར་ཕྱོགས་པ་དང་། ལྷ་དང་མིའི་ཕུན་སུམ་ཚོགས་པ་རྒུད་པའི་སྒོར་གཞོལ་བ་ཡོངས་སུ་སྟོན་པ་དང་། མི་སྡུག་པའི་དཀྱིལ་འཁོར་རབ་ཏུ་སྟོན་པ་དང་། འཇིག་རྟེན་གྱི་སྡུག་པའི་འདུ་ཤེས་ཀྱིས་ཕྱིན་ཅི་ལོག་རྣམ་པར་བཟློག་པ་དང་། མི་རྟག་པ་དང་། གཡོ་བ་དང་། འཇིག་པ་དང་། འགྱུར་བའི་ཆོས་ཉིད་ཡོངས་སུ་སྟོན་པ་དང་། འདུ་བྱེད་ཐམས་ཅད་ཀྱི་ཆོས་ཉིད་སྡུག་བསྔལ་ཞིང་བདག་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཡུལ་ལ་གནས་པ་དང་། མི་འབྲལ་བར་མོས་པར་བྱེད་པ་དང་། དེ་བཞིན་གཤེགས་པའི་ཚུལ་ཁྲིམས་ཤིན་ཏུ་དག་པར་བྱ་བའི་ཕྱིར།
en: demonstrating nondependence on all worlds, no concern for all fields of perception, and the rejection of all locations in saṃsāra; demonstrating entering the gateway to the decline of the good fortune of devas and humans; demonstrating the field of unattractiveness; dispelling the incorrect perception of attractiveness in the world; revealing the nature of phenomena to be impermanence, instability, destruction, and change; showing the true nature of all that is composite to be suffering and the absence of a self; yearning to dwell inseparably within the field of activity of the tathāgatas;

source: སེམས་ཅན་རྣམས་ལ་ཡང་དག་པར་བསྐུལ་བ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་གྱི་སྒྲས་ཚུལ་ཁྲིམས་ཀྱི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་ཚིམ་པར་བྱེད་པའི་ཚུལ་ཁྲིམས་ཀྱི་དྲི་ཞིམ་པོ་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་།
en: inspiring beings toward the perfectly stainless conduct of the tathāgatas; teaching to beings, in accordance with their aspirations and languages, the practice of correct conduct; manifesting the lovely scent of correct conduct that brings satisfaction to beings; and ripening all beings.

source: སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པའི་ལུས་ཁ་དོག་སྣ་ཚོགས་སུ་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ།
en: He saw, issuing forth from all her pores, clouds of emanated bodies of various colors, which were as numerous as all beings, teaching the endurance by all beings of the major and minor parts of their bodies being cut off;

source: ཡན་ལག་དང་ཉིང་ལག་ཐམས་ཅད་ཀྱང་ཉམས་སུ་བཟོད་པ་སེམས་ཅན་ཐམས་ཅད་ལ་ཡོངས་སུ་སྟོན་པ།
en: teaching the endurance by all beings of harm to their bodies;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱིས་ལུས་ལ་གནོད་པར་ཐོ་བརྩམས་ཀྱང་ཉམས་སུ་བཟོད་པར་བྱེད་པ་དང་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཚུལ་དང་མི་འདྲ་བའི་ཚིག་གིས་སྤྱོ་བ་དང་། བརྒྱད་པ་དང་། སྨད་པ་དང་། བསྐྱུང་བ་དང་། བརྡེག་པ་དང་། བསྡིགས་པ་ཉམས་སུ་བཟོད་པར་བྱེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱིས་མི་སྒུལ་བ་ཡོངས་སུ་སྟོན་པ་དང་། རིམ་གྲོར་བྱས་པ་དང་། རིམ་གྲོར་མ་བྱས་པ་ཐམས་ཅད་ཀྱིས་མཐོ་བ་དང་དམའ་བར་མི་འགྱུར་བ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་ང་རྒྱལ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་ལ་བཟོད་པ་མི་ཟད་པས་ཡེ་ཤེས་མི་ཟད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་ཡོངས་སུ་སྤང་བའི་ཕྱིར་བཟོད་པའི་སྤྱོད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལུས་དབྱིབས་མི་སྡུག་ཅིང་།
en: teaching the endurance by all beings of being falsely reviled, censured, reproached, disgraced, and threatened; teaching the imperturbability of all beings; teaching all beings to be neither uplifted by honors nor made downcast by disrespect; teaching humility in all beings; teaching the unceasing wisdom of the unceasing patience toward the nature of all phenomena; teaching the practice of patience that eliminates the kleśas in all beings;

source: ཁ་དོག་མི་མཛེས་པའི་གཟུགས་རྣམ་པར་ཟློག་པ་བྱེད་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ལ་དེ་བཞིན་གཤེགས་པའི་སྐུ་མདོག་རྣམ་པར་དག་པ་བླ་ན་མེད་པ་ཡོངས་སུ་སྟོན་ཅིང་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: turning all beings away from misshapen bodies with ugly color; teaching the supreme pure color of the tathāgatas; and ripening beings.

source: །བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་སེམས་ཅན་ཐམས་ཅད་དང་མཉམ་པའི་སྐྱེ་བ་སྣ་ཚོགས་ཀྱི་ལུས་ཁ་དོག་དང་དབྱིབས་དང་། ཆུ་ཞེངསྣ་ཚོགས་སུ་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ། སེམས་ཅན་རྣམས་ཀྱི་བསམ་པ་ཇི་ལྟ་བ་བཞིན་དུ་རྒྱས་པར་ཁྱབ་པར་བྱས་ནས།
en: He saw, issuing forth from all her pores, clouds of emanated bodies of various colors, shapes, and sizes, equal in number to that of all beings, which spread everywhere in accordance with the aspirations of beings, teaching exertion in diligence for the great accumulation of omniscience; the diligence that puts to flight all discord from the māras; the diligence that is constant and unwavering in undertaking the attainment of enlightenment; the diligence for rescuing all beings from the ocean of saṃsāra; the diligence that turns beings away from all the paths that lead to unfortunate existences, calamitous existences, terrible existences, and downfalls;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཆེན་པོ་ལ་བརྩོན་འགྲུས་ཀྱིས་སྔོན་དུ་འདོར་བ།
en: the diligence for shattering to pieces the mountain of ignorance;

source: ཡང་དག་པར་སྟོན་པ་དང་། བདུད་ཀྱི་དཀྲུགས་མ་ཐམས་ཅད་རྣམ་པར་འཐོར་བའི་བརྩོན་འགྲུས་དང་། བྱང་ཆུབ་ཏུ་བརྩམས་པ་མི་འཁྲུགས་མི་ཟློགས་པའི་བརྩོན་འགྲུས་དང་། སེམས་ཅན་ཐམས་ཅད་འཁོར་བའི་རྒྱ་མཚོ་ལས་རབ་ཏུ་བསྒྲལ་བའི་བརྩོན་འགྲུས་དང་མི་ཁོམ་པ་དང་ངན་སོང་དང་། ངན་འགྲོ་དང་ལོག་པར་ལྟུང་བའི་ལམ་ཐམས་ཅད་རྣམ་པར་བཟློག་པའི་བརྩོན་འགྲུས་དང་། མི་ཤེས་པའི་རི་རྣམ་པར་གཏོར་བའི་བརྩོན་འགྲུས་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་མཆོད་ཅིང་བསྙེན་བཀུར་བས་ཡོངས་སུ་མི་སྐྱོ་བའི་བརྩོན་འགྲུས་དང་། སངས་རྒྱས་ཐམས་ཅད་ཀྱི་ཆོས་ཀྱི་འཁོར་ལོ་ཡང་དག་པར་བླང་བ་དང་། ཡོངས་སུ་བཟུང་བའི་བརྩོན་འགྲུས་དང་། སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རབ་ཏུ་གཞོམ་ཞིང་རྣམ་པར་གཏོར་བའི་བརྩོན་འགྲུས་དང་། སེམས་ཅན་ཐམས་ཅད་ཡོངས་སུ་སྨིན་པར་བྱ་བ་དང་། གདུལ་བས་མི་སྐྱོ་བའི་བརྩོན་འགྲུས་དང་། སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བའི་བརྩོན་འགྲུས་དང་། དེ་བཞིན་གཤེགས་པའི་བརྩོན་འགྲུས་རྣམ་པར་དག་པ་བླ་ན་མེད་པ་ཡོངས་སུ་སྟོན་ཅིང་།
en: the diligence that never wearies in serving and making offerings to all the tathāgatas; the diligence for receiving and holding the Dharma wheel of all the buddhas; the diligence for shattering and scattering the mountain of all obscurations; the diligence that never wearies of ripening and guiding all beings; and the diligence for purifying all buddha realms and teaching the pure, unsurpassable diligence of the tathāgatas, and he saw them ripening beings.

source: སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་། །བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ལུས་སྣ་ཚོགས་ཁ་དོག་དང་དབྱིབས་རྣམ་པ་ཐ་དད་པར་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ།
en: He saw, issuing forth from all her pores, clouds of emanated bodies of various colors and shapes that through various methods brought joy to beings; prevented unhappiness; condemned all delights in desire; proclaimed in the world the quality of a sense of shame; brought beings to control of their senses; praised the unsurpassable conduct of celibacy; taught the fearfulness of the world of desire and the realm of Māra ; taught all the worlds that are the range of desire, even to those who were free from delighting in desires;

source: ཐབས་སྣ་ཚོགས་ཀྱིས་སེམས་ཅན་རྣམས་ཀྱི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། ཡིད་བདེ་བ་རྣམ་པར་ཟློག་པ་དང་། འདོད་པའི་དགའ་བ་ཐམས་ཅད་རྣམ་པར་སྨོད་པ་དང་། ངོ་ཚ་ཤེས་པའི་ཆོས་ཉིད་འཇིག་རྟེན་དུ་སྒྲོག་པ་དང་། དབང་པོ་བསྡམས་པ་ལ་སེམས་ཅན་རྣམས་རབ་ཏུ་དགོད་པ་དང་། ཚངས་པའི་སྤྱོད་པ་བླ་ན་མེད་པ་ཡང་དག་པར་བསྔགས་པ་བྱེད་པ་དང་། འདོད་པའི་འཇིག་རྟེན་བདུད་ཀྱི་ཡུལ་འཇིག་པ་དང་བཅས་པར་ཡོངས་སུ་སྟོན་པ་དང་། འདོད་པའི་དགའ་བ་དང་བྲལ་བ་རྣམས་ལ་འཇིག་རྟེན་གྱི་འདོད་པ་དང་། དགའ་བའི་ཡུལ་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ་དང་། ཆོས་ལ་མོས་ཤིང་དགའ་བ་ལ་སེམས་ཅན་རབ་ཏུ་དགོད་པ་དང་། མཐར་གྱིས་བསམ་གཏན་དང་། ཏིང་ངེ་འཛིན་དང་སྙོམས་པར་འཇུག་པའི་སྒོ་མངོན་པར་བསྒྲུབ་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉོན་མོངས་པ་ཐམས་ཅད་རྣམ་པར་གསལ་བ་ལ་ངེས་པར་རྟོགས་པའི་སེམས་ཡོངས་སུ་རྗོད་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་ཏིང་ངེ་འཛིན་རྒྱ་མཚོའི་རྣམ་པར་འཕྲུལ་པ་ཐམས་ཅད་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་མངོན་པར་ཤེས་པ་དང་། རྣམ་པར་འཕྲུལ་པ་དང་། ཁྱུ་མཆོག་གི་མཐུ་ཕྱུང་བ་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་།
en: caused beings to delight in the pleasures of the Dharma; enabled the successive attainment of the gateways to dhyāna, samādhi, and samāpatti; described the mind that comprehends the elimination of all kleśas in all beings; taught all the miraculous manifestations of the ocean of bodhisattva samādhis; taught the miracles and supremacy of the higher cognitions of the bodhisattvas;

source: སེམས་ཅན་རྣམས་ཀྱི་དགའ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། སྤྲོ་བ་འཕེལ་བར་བྱ་བ་དང་། ཉམས་བདེ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། ཡིད་མི་བདེ་བ་བཟློག་པ་དང་། སེམས་སྐྱོན་མེད་པ་ཡོངས་སུ་བསྒྲུབ་པ་དང་། སེམས་ཅན་ལས་སུ་རུང་བར་བྱ་བ་དང་། བསམ་པ་རྣམ་པར་སྦྱང་བ་དང་། དབང་པོ་གསལ་བར་བྱ་བ་དང་། ལུས་ཀྱི་བདེ་བ་ཡོངས་སུ་བསྐྱེད་པ་དང་། ཆོས་ལ་དགའ་བའི་ཤུགས་རྣམ་པར་འཕེལ་བར་བྱ་བ་བྱེད་ཅིང་།
en: brought joy to all beings; increased enthusiasm; created happiness; dispelled unhappiness; caused the attainment of faultless minds; made minds skillful; purified thoughts;

source: སེམས་ཅན་རྣམས་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: clarified the senses; brought physical bliss; magnified the power of delight in the Dharma;

source: །བ་སྤུའི་སྒ་ཐམས་ཅད་ནས།
en: and thus ripened beings.

source: སྐྱེ་བ་ཐམས་ཅད་དང་འདྲ་བའི་ལུས་ཀྱི་སྤྲིན་སྣ་ཚོགས་འཐོན་ཏེ།
en: He saw, issuing forth from all her pores, clouds of various bodies resembling all bodies that appear, in order to appear in accordance with the wishes of all beings within all realms, demonstrating unwearyingly going into the presence of kalyāṇamitras; demonstrating unwearying service and attendance to ācāryas, gurus, and kalyāṇamitras; demonstrating the diligence that never wearies of receiving and holding the turning of the Dharma wheel of all the tathāgatas;

source: ཞིང་ཐམས་ཅད་ཀྱི་ཁོངས་སུ་ཆུད་པའི་སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཡིད་བཞིན་དུ་བསྟན་པའི་ཕྱིར་དགེ་བའི་བཤེས་གཉེན་གྱི་གན་དུ་འགྲོ་བས་སྐྱོ་བ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སློབ་དཔོན་དང་། བླ་མ་དང་། དགེ་བའི་བཤེས་གཉེན་ལ་རིམ་གྲོར་བྱ་བ་དང་། བསྙེན་བཀུར་བས་སྐྱོ་བ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ཆོས་ཀྱི་འཁོར་ལོ་འཁོར་བ་ཡང་དག་པར་བླང་ཞིང་ཡོངས་སུ་བཟུང་བས་སྐྱོ་བ་མེད་པའི་བརྩོན་འགྲུས་ཡོངས་སུ་སྟོན་པ་དང་། སངས་རྒྱས་རྒྱ་མཚོ་ཐམས་ཅད་ཁོང་དུ་ཆུད་པར་བྱ་བའི་ཚུལ་ཡང་དག་པར་བརྗོད་པ་དང་། ཆོས་ཀྱི་སྒོ་རྒྱ་མཚོ་ཐམས་ཅད་རྣམ་པར་འབྱེད་པ་དང་། ཆོས་ཐམས་ཅད་ཀྱི་མཚན་ཉིད་དང་རང་བཞིན་དང་ཚུལ་མངོན་པར་བརྗོད་པ་དང་། ཆོས་ཐམས་ཅད་ཏིང་ངེ་འཛིན་གྱི་སྒོར་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་དྲི་བ་དང་ཐེ་ཙོམ་རྒྱ་མཚོ་རྣམ་པར་སེལ་བས་ཤེས་རབ་ཀྱི་ཡུལ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཅན་ཐམས་ཅད་ཀྱི་ལྟ་བའི་རི་ཤིན་ཏུ་འཇོམས་པའི་ཤེས་རབ་རྡོ་རྗེ་ཡོངས་སུ་སྟོན་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་གཅིག་དང་ལྡན་པས།
en: describing the way of comprehending the ocean of all the buddhas; contemplating the ocean of all Dharma entrances; explaining the characteristics, natures, and ways of all Dharmas; teaching the entrances into the samādhis of all Dharmas; teaching the range of wisdom that dispels the ocean of questions and doubts of all beings; teaching the vajra of wisdom that destroys the mountains of wrong views of all beings;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་མ་རིག་པའི་མུན་པ་རྣམ་པར་སེལ་བའི་ཤེས་རབ་ཀྱི་ཉི་མའི་དཀྱིལ་འཁོར་འཆར་བ་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་།
en: teaching, with every instant of mind, the rising of the disk of the sun of wisdom that dispels the darkness of the ignorance of all beings;

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་དགའ་བ་ཡོངས་སུ་སྐྱེ་བར་བྱ་བས་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: and ripening beings by bringing happiness to all beings.

source: །བ་སྤུའི་སྒོ་ཐམས་ཅད་ནས་ཁ་དོག་དང་དབྱིབས་བསམ་གྱིས་མི་ཁྱབ་པའི་ལུས་མང་པོ་འགྲོ་བ་ཐམས་ཅད་དང་མཉམ་པའི་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ་བསམ་པ་དང་མོས་པ་ཇི་ལྟ་བ་བཞིན་དུ་སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་དུ་གནས་ཤིང་། སྒྲ་སྐད་སྣ་ཚོགས་ཀྱིས་ཡོངས་སུ་སྦྱང་བའི་བསྟན་པས་འཇིག་རྟེན་པའི་བསོད་ནམས་དང་བསོད་ནམས་མ་ཡིན་པ་མངོན་པར་སྟོན་པ་དང་། འཇིག་རྟེན་པའི་བྱ་བ་ཐམས་ཅད་རབ་ཏུ་རྒྱུ་བ་དང་ཁམས་གསུམ་པ་འབྱུང་བ་ཐམས་ཅད་ཡོངས་སུ་བསྟན་པ་དང་། ཁམས་གསུམ་པ་ཐམས་ཅད་ལས་འབྱུང་བའི་ཕྱོགས་ཡང་དག་པར་བརྗོད་པ་དང་། ལྟ་བའི་མྱ་ངན་མི་བཟད་པ་ཐམས་ཅད་ལས་འབྱུང་བའི་ཕྱོགས་ཡང་དག་པར་བསྟན་པས། ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་གྱི་ཁྱད་པར་ཡོངས་སུ་བརྗོད་པ་དང་། ཉན་ཐོས་དང་རང་སངས་རྒྱས་ཀྱི་སའི་ལམ་ལས་ཡོངས་སུ་བཟླ་བ་ཡང་དག་པར་སྟོན་པ་དང་། རིམ་གྲོར་བྱས་པ་དང་། རིམ་གྲོར་མ་བྱས་པ་ལ་བྱམས་སྡང་གིས་གོས་པ་མེད་པར་ཡོངས་སུ་སྟོན་པ་དང་། འཁོར་བ་དང་མྱ་ངན་ལས་འདས་པའི་སྒོ་ལ་མི་གནས་པ་ཡང་དག་པར་སྟོན་པ་དང་། དགའ་ལྡན་གྱི་གནས་ལ་སྩོགས་པ་གཅིག་ནས་གཅིག་ཏུ་རྒྱུ་བ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་དང་། སྙིང་པོ་བྱང་ཆུབ་ཏུ་སོང་ཞིང་མངོན་པར་རྫོགས་པར་འཚང་རྒྱ་བ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་བྱེད་ཅིང་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: He saw, issuing forth from all her pores, clouds of emanations of many bodies of inconceivable colors and shapes, equal to those of all beings, becoming present before all beings in accordance with their motivations and aspirations, and teaching, giving instructions by having mastered various languages, the knowledge of what is meritorious in the world and what is not meritorious. He saw the worldly deeds that should be accomplished, the description of the origin of all three realms, the explanation of the direction that leads to leaving all three realms, the teaching of the direction that leads to leaving the unendurable misery of wrong views, and thereby the teaching of the unique path to omniscience, the teaching of the transcending of the path of the śrāvaka and pratyeka­buddha levels, the teaching of being unstained by anger or love toward those who show respect and those who disrespect, the teaching of nonengagement with the gateways to either saṃsāra or nirvāṇa, the teaching of the unceasing successive passage from one place to another such as the Tuṣita paradise, the teaching of the unceasing succession of going to the bodhimaṇḍa and attaining complete buddhahood, and the ripening of beings for omniscience.

source: །བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ལུས་སྤྲུལ་པའི་སྤྲིན་འཐོན་ཏེ།
en: He saw, issuing forth from all her pores, clouds of emanated bodies as numerous as the atoms in all buddha realms and visibly present in all worlds of beings.

source: སེམས་ཅན་གྱི་འཇིག་རྟེན་ཐམས་ཅད་ལ་མངོན་སུམ་དུ་གནས་ཤིང་བྱང་ཆུབ་སེམས་དཔའ་ཀུན་ཏུ་བཟང་པོའི་སྤྱོད་པ་དང་སྨོན་ལམ་ཡོངས་སུ་བརྗོད་པ་དང་། ཆོས་ཀྱི་དབྱིངས་ཐམས་ཅད་རྣམ་པར་དག་པའི་མཐར་ཐུག་པའི་སྨོན་ལམ་གྱི་ཁྱད་པར་ཡོངས་སུ་བརྗོད་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ཡོངས་སུ་དག་པར་བྱ་བ་ཡོངས་སུ་བརྗོད་པ་དང་། དེ་བཞིན་གཤེགས་པ་ཐམས་ཅད་ལ་མཆོད་ཅིང་རིམ་གྲོར་བྱ་བ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་བརྗོད་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་ཆོས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་དང་། འཇིག་རྟེན་གྱི་ཁམས་རྒྱ་མཚོ་ཐམས་ཅད་ཀྱི་རྡུལ་ཤིན་ཏུ་ཕྲ་བ་སྙེད་ཀྱི་ཆོས་ཀྱི་དབྱིངས་ཀྱི་ཚུལ་རྒྱ་མཚོ་ལ་འཇུག་པ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཞིང་ཐམས་ཅད་དུ་ཕྱི་མའི་མཐའི་བསྐལ་པའི་མུར་ཐུག་པར་གནས་ཤིང་།
en: They were describing the completely good bodhisattva conduct and prayer; describing the special prayer for the perfect purification of the entire realm of phenomena; describing the purification of the entire ocean of world realms in each instant of mind; describing continuous service and offering to all the tathāgatas; teaching the continuous entry into the ocean of all the ways of the Dharma in each instant of mind;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ལམ་རྣམ་པར་དག་པར་བྱ་བ་ཡོངས་སུ་བརྗོད་པ་རྒྱུན་མི་འཆད་པ་ཡང་དག་པར་སྟོན་པ་དང་། སེམས་ཀྱི་སྐད་ཅིག་རེ་རེ་ལ་དེ་བཞིན་གཤེགས་པའི་སྟོབས་ལ་འཇུག་པ་རྒྱུན་མི་འཆད་པ་ཡང་དག་པར་བརྗོད་པ་དང་། དུས་གསུམ་གྱི་ཚུལ་རྒྱ་མཚོ་ཐམས་ཅད་ལ་འཇུག་པ་རྒྱུན་མི་འཆད་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཞིང་ཐམས་ཅད་དུ་རྫུ་འཕྲུལ་གྱི་རྣམ་པར་འཕྲུལ་པ་ཡོངས་སུ་བསྟན་པ་རྒྱུན་མི་འཆད་པ་ཡང་དག་པར་སྟོན་པ་བྱེད་ཅིང་།
en: describing the continuous entry into the ocean of the ways of the realm of phenomena, which are as numerous as the atoms in the entire ocean of world realms, in each instant of mind; describing the continuous teaching of the purification of the path to omniscience while remaining resolutely throughout all future kalpas in all realms; describing continuous entry into the strengths of the tathāgatas in each instant of mind; teaching continuous entry into the ocean of all the ways of the three times; teaching the continuous manifestation of miraculous powers in all realms;

source: བྱང་ཆུབ་སེམས་དཔའི་སྨོན་ལམ་དང་། སྤྱོད་པ་ཡོངས་སུ་བསྟན་པས་སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ལ་རབ་ཏུ་འགོད་པ་མཐོང་ངོ་།
en: and establishing all beings in omniscience through the teaching of bodhisattva prayer and conduct.

source: །བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་མཉམ་པའི་ལུས་ཀྱི་སྤྲུལ་པའི་སྤྲིན་མང་པོ་འཐོན་ཏེ།
en: He saw, issuing forth from all her pores, clouds of emanated bodies as numerous as the minds of all beings, and in the presence of all beings teaching the limitless strength of the accumulation of omniscience;

source: སེམས་ཅན་ཐམས་ཅད་ལ་མངོན་པར་གནས་ཤིང་།
en: teaching the inexhaustible, indestructible, and everlasting strength of the mind that knows all phenomena;

source: ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཚོགས་ཀྱི་སྟོབས་མུ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཐམས་ཅད་མཁྱེན་པའི་སེམས་ཀྱི་སྟོབས་མི་ཟད་པ་དང་། མི་འཇིགས་པ་དང་། ཆུད་མི་ཟ་བའི་ཆོས་ཅན་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པ་ཐམས་ཅད་ཡོངས་སུ་སྒྲུབ་པའི་སྟོབས་ཕྱིར་མི་ལྡོག་ཅིང་ཕྱིར་མི་ཟློག་ཐུབ་པ་མེད་པ་དང་། རྒྱུན་མེད་པ་དང་། བླ་ན་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་འཁོར་བའི་ཉེས་པ་ཐམས་ཅད་ཀྱིས་མི་གོས་པ་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་བདུད་ཀྱི་དཀྱིལ་འཁོར་ཐམས་ཅད་རྣམ་པར་འཐོར་བ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་ཉོན་མོངས་པ་ཐམས་ཅད་ཀྱི་དྲི་མས་ཉེ་བར་ཉོན་མོངས་པ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། །བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་ལས་ཀྱི་སྒྲིབ་པ་ཐམས་ཅད་ཀྱི་རི་རྣམ་པ་འཐོར་བ་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྙིང་རྗེ་ཆེན་པོའི་སྟོབས་བསྐལ་པ་ཐམས་ཅད་དུ་གནས་ཀྱང་།
en: teaching the irreversible, nonregressive, invincible, ever-continuing, unsurpassable strength of the attainment of all bodhisattva conduct; teaching the bodhisattva strength that is unstained by any of the faults of saṃsāra; teaching the bodhisattva strength that disperses the entire army of Māra ; teaching the bodhisattva strength that is unafflicted by the stains of any of the kleśas; teaching the bodhisattva strength that disperses the mountain of all karmic obscurations;

source: བྱང་ཆུབ་སེམས་དཔའི་སྤྱོད་པས་སྐྱོབ་མེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་སངས་རྒྱས་ཀྱི་ཞིང་ཐམས་ཅད་ཡོངས་སུ་བསྐྱོད་ཅིང་བསྐུལ་བས།
en: teaching the bodhisattva strength of great compassion that continues throughout all kalpas with unwearying bodhisattva conduct; teaching the bodhisattva strength that brings happiness to all beings by shuddering and shaking all buddha realms;

source: སེམས་ཅན་ཐམས་ཅད་རབ་ཏུ་དགའ་བར་བྱེད་པ་ཡོངས་སུ་སྟོན་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་རྣམས་ཀྱི་སྟོབས་བདུད་དང་། ཕས་ཀྱི་རྒོལ་བའི་ཚོགས་ཐམས་ཅད་རབ་ཏུ་འཇོསམ་པ་ཡོངས་སུ་སྟོན་པ་དང་། ཆོས་ཀྱི་འཁོར་ལོ་བསྐོར་བའི་ཡེ་ཤེས་ཀྱི་སྟོབས་ཆེན་པོ་འཇིག་རྟེན་དུ་རབ་ཏུ་བརྗོད་པ་བྱེད་ཅིང་སེམས་ཅན་ཐམས་ཅད་ཐམས་ཅད་མཁྱེན་པ་ཉིད་དུ་ཡོངས་སུ་སྨིན་པར་བྱེད་པ་མཐོང་ངོ་།
en: teaching the bodhisattva strength that defeats all the hosts of māras and adversaries; and elucidating in the world the great strength of the wisdom of turning the Dharma wheel and thus ripening all beings for omniscience. He saw, issuing forth from all her pores, clouds of emanated bodies, as numerous as the minds of all beings, which spread throughout the infinite realms of beings in the ten directions, teaching in accordance with the motivations and aspirations of beings the prowess of bodhisattva conduct and wisdom; teaching the wisdom that comprehends the ocean of all the realms of beings; teaching the wisdom that comprehends the ocean of the minds of all beings; teaching the wisdom that knows the ocean of the faculties of all beings;

source: །བ་སྤུའི་སྒོ་ཐམས་ཅད་ཀྱི་བ་སྤུའི་སྒོ་རེ་རེ་ནས་ཀྱང་ལུས་ཀྱི་སྤྲུལ་པ་རྒྱ་མཚོ་ཁ་དོག་མཐའ་ཡས་པ་འགྲོ་བ་ཐམས་ཅད་ཀྱི་སེམས་དང་མཉམ་པའི་སྤྲིན་ཕྱོགས་བཅུ་མཐའ་ཡས་པའི་སེམས་ཅན་གྱི་ཁམས་སུ་རྒྱས་པར་འགེངས་པ་འཐོན་ཏེ།
en: teaching the wisdom that comprehends the ocean of the conducts of all beings;
